#кешко маргарита
books = [
    {"title": "Дверь в лето", "author": "Роберт Хайнлайн", "year": 1956},
    {"title": "Джейн Эйр", "author": "Шарлотта Бронте", "year": 1847},
    {"title": "Мастер и Маргарита", "author": "Михаил Булгаков", "year": 1967},
    {"title": "Хроники странствующего кота", "author": "Хиро Арикава", "year": 2002},
    {"title": "Записки из мертвого дома", "author": "Федор Достоевский", "year": 1862}
]#создали список с любимыми книгами
for i, book in enumerate(books, 1):
    print(f"Книга {i}")
    print(f"Название: {book['title']}, Автор: {book['author']},")
    print(f"---{book['year']}---\n")#выводим на консоль 